In [1]:
import numpy as np
import pandas as pd

from pandas import DataFrame

In [3]:
data = {
    'names': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank', 'Grace'],
    'age': ['25', '30', '22', '28', '35', '40', '27'],
    'gender': ['Female', 'Male', 'Male', 'Male', 'Female', 'Male', 'Female'],
    'rank': ['3', '2', '1', '7', '6', '4', '5']
}

In [6]:
df = pd.DataFrame(data)

df.iloc[2:5, 1] = np.nan
df.iloc[3:6, 3] = np.nan
df.iloc[3, :] = np.nan

df

     names  age  gender rank
0    Alice   25  Female    3
1      Bob   30    Male    2
2  Charlie  NaN    Male    1
3      NaN  NaN     NaN  NaN
4      Eva  NaN  Female  NaN
5    Frank   40    Male  NaN
6    Grace   27  Female    5

In [9]:
age_mask = pd.isnull(df['age'])
df[age_mask]

     names  age  gender rank
2  Charlie  NaN    Male    1
3      NaN  NaN     NaN  NaN
4      Eva  NaN  Female  NaN